
int main()
{
	// 00000000 00000000 00000000 00000001
	int Value = 1;

	// 00000000 00000000 00000000 00000010
	Value = 2;
	// 2진수 표현을 하는 방법.
	Value = 0b00000000000000000000000000000000;  //  Value = 0; 과 같다.

	Value = 0b11111111111111111111111111111111;  //  int 형이 표현할수있는 최대값으로 예상하지만
	// 결과값은 -1 이 출력된다.
	// 그이유는 맨 앞의 비트는 정수의 부호를 결정하는 비트로 할당하면서
	// -0이라는 수학적으로 불가능한 표현이 생기면서
	// 2의 보수법 이라는 약속을 통해서 해결했다.
	// 음수를 표현할때에는 역수를 취하기로 했다.

	// 음수로 받으면 비트를 반대로 표현하기로 한다.
	Value = 0b11111111111111111111111111111111; // 를 -1로 두고 
	Value = 0b11111111111111111111111111111100; // 비트 가 0이된값을 -1과 더해서 계산한다.
	// -3로 취급한것과 -1을 더해서 -4를 출력하게 된다.
	
	// 이로인해서 
	// 음수의 표현이 양수보다 항상 절댓값이 1만큼 더 많이 표현할수 있다.
	// int의 최대값은 2147483647 이지만  모든비트가 0일땐 0
	// int의 최솟값은-2147483648 이다.  모든비트가 1일떈 -1 이기 때문에.
	
	// 0부터 시작하는 것과 1부터 시작하는 것의 차이라고 보면 된다.




}
