// 036_Global.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

//{
// // 특정 지역에 속하는 것을 지역변수라고 합니다.
//}

// 어떠한 지역에도 속하지 않은 변수를 만들어 낼수가 있습니다.
// 이름이 있는 함수나 그 외부에 있는 변수들을 
// 전역변수라고 부릅니다.

int GlobalValue = 0;        //전역 변수
// 전역 변수는 선언 이후 아래부터 어디서든 사용할수 있습니다.
// 어디에도 속해있지 않기 때문에 존재만 알고 있다면
// 어디서든 사용할수 있습니다.
// 전역 변수는 데이터 영역에 위치하게 된다.

void Function()     // 전역 변수
{
    ++GlobalValue;  // 전역 변수에서 선언된 변수를 사용.
    int Result = 0;   // 지역 변수.
}

int main()
{ // 지역의 시작
    int Value = 0; // 지역변수라고 합니다.

    Result;      // Function의 지역변수이므로 불러올수 없다.

    Function();  // 전역 변수에 선언된 함수명을 불러올수 있다.

    std::cout << "Hello World!\n";
} // 지역의 끝
