
#include <iostream>

int main()
{
    // 램은 비트의 집합이다.
    // char은 1바이트의 문자형이다.

    // 아스키코드라고하는 각 비트에 대응하는 문자값을 가진다.

    char Ch = 'A';
    // 1바이트면 비트가 8개가 되고
    // 정수로 표현한다면 255개
    // 일단 문자를 표현하는 방식은
    //1가지 밖에 없다.


    // 앞쪽에 L을 붙여서 표현하면
    // 2바이트 문자형이고 대문자L을 붙여서 표현한다.
    // 2바이트 문자형을 유니코드라고함.
    wchar_t wch = L'A';

    // 각 나라의 모든 문자를 표기하기에는 유니코드로도 한계가 생겨서
    // 국가 코드라는게 생겼다.
    // UTF-8이라는것이 나왔다.
    // 다국어 지원을 위해서 필요하지만 현재로서는 쓸일은 없다.
    // 알아두기만 하자.
    // 글자를 1 2 3 4 바이트로 따로 표현하게 된다.
    // u8 표현은 C++ 14버전 이상부터 사용이 가능하다.

    char Arr = u8'A';

    // 이런 개념을 인코딩이라고 부릅니다.

    // 아스키코드는 255개만 표현
    // 멀티바이트는 어떤건 1바이트 어떤건 2바이트로 표현
    // 와이드 바이트 모두다 2바이트 == 유니코드
    // utf8 utf16 utf32   현재의코드는 옆의 방식으로 작성되어짐 
    





}
