// #define _DEBUG

// 089_ifdef.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

#define TEST int A;

// 복붙 말고도
// CCCC를 디파인 했다.
#define CCCC

// CCCC가 정의되었다면
#ifdef CCCC
// 내부의 코드를 컴파일해라.
// => CCCC가 존재하지 않는다면 이 내부의 코드는 존재하지 않는코드가 된다.
int Value = 20;
#else
int Value = 30;
#endif

#ifdef _DEBUG
// 디버그 모드로 빌드할때
#else
// 다른 모드로 빌드할때
#endif


int main()
{
    Value = 20;

    std::cout << "Hello World!\n";
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
