// #include <iostream>   <= 파일 입출력을 위해서 사용하는 헤더 이기때문에
// 헤더는 최저한의 사용을 위하여 필요한 헤더만을 #include해놓는 습관을 들이자.
// 쓰지도 않는 헤더를 나열해놓으면 컴파일상 불리하다.

int main()
{
	// 연산자는 특정 메모리를 변화시키는 명령을 축약해 놓은 기호.


	// int는 00000000 00000000 00000000 00000000  4바이트 만큼의 메모리를 할당하고 
	// 그 공간을 Ringt라는 변수명으로 기억해두게 된다.

	// " = " 의 의미는 =을 기준으로 왼쪽에있는 메모리 영역에 오른쪽에있는 비트를 넣어라.
	// 1. 램에서 특정 4바이트의 공간을 할당하고
	// 2. 또 다른 특정 메모리에 있는 '100' 이라는 수의 비트값을 가져와서
	// 3. 그 값을 복사해서 넣어라.

	// Right에 들어있을 초기 비트값은 중요하지않다.(쓰레기 값이 들어있다.)

	int Right = 7;
	int Left = 3;

	// 이미 만들어져있는 Right에 해당하는 비트값을 50으로 바꿔라.
	Right = 50;


}

