
#include <iostream>

int main()
{
    // 함수의 스택에서 메모르 크기는 컴파일시 고정되어야 한다.
    // 

    int ArrSize = 20;

    int Value[10] = {};
    // int Value[ArrSize] = {};
    // 는 오류가 난다.
    // 배열의 크기로 변수는 사용이 불가능하기 때문에 발생하는 오류이다.
    // 변수이면 언제든지 수가 변할수있는데 배열은 미리 정해진 크기에 접근하게 되기때문에.

    // const 를 사용한다면?
    const int Arrsize2 = 20;
    // 앞으로 Arrsize2는 절대 바꾸지않고 항상 상수20으로 생각하겠다.

    int Value[Arrsize2] = {};
    // 가능하게 된다.
    //const는 특정 자료형 앞에 const 키워드를 붙이면 
    // 그 메모리의 비트적 상수화를 시킨다.
    // 간단하게 변할수없는 상수값으로 지정해준다고 생각하면 된다.




}
