// 자동으로 콘솔창을 띄운다. 라는것이 전제되어있다.
// 속성 -> 링커 -> 하위 시스템에서 확인가능.

#include <iostream>



int main()
{
	// 이안에 어떠한 내용을 적음으로 인해서
	// 게임이 만들어지게 되는 개념입니다.
	
	// 숫자를 하나 선언하는 방법에 대해서 알아보자.

	// 함수의 시작과 함수의 끝 사이를 스코프 혹은 지역이라고 부릅니다.

	// 지역에 선언된 메모리라고 합니다.
	10;  // <= 이런 고정된 숫자를 상수라고 부릅니다.
	// C++ 표준에서 정의해놨다.
	// 열거형
	// 사용자 정의 자료형
	// 정수형 : 대표적으로 int 가 있다. int 는 4byte만큼의 크기를 할당
	// 실수형
	// 논리형

	// 이런 형들에는 그것을 표현하기 위한 자료형이 있고
	// 그 다음에 이름을 붙여주는 것이 기본입니다.  (선언한다고 함)

	int Att;  // int가 자료형이 되고  Att가 이름(변수)이 됩니다.
	// 정수 Att를 만들어야 해. 를 수행하게된다.
	int Att; // 같은 변수 Att를 한번 더 선언하게 되면 에러가 난다.
	// 중복되는 변수는 선언할 수 없다.

	// 변수를 선언하는 법
	int PlayerAtt;
	int PlayerDef;
	int PlayerHP;
	int MonsterAtt;
	int MonsterDef;
	int MonsterHP;


	// 자료형의 의미
	// 1. 바이트의 크기 int는 크기가 4byte이다.
	// 2. 처리형태 <= 그리고 정수이다.

	// 이름이 의미하는 것
	// 1, 위치 <= 내프로그램에서 상대적 위치 <= 주소값으로 치환된다.

	

   
}
