
#include <iostream>

int main()
{
    
    // 콘솔창에 문자를 글자를 띄운다는 함수.
    printf_s("aadads");

    char Arr[5] = "abc";
    printf_s(Arr);  // abc가 출력됨.

    //문자 1과 숫자1은 완전히 다르게 인식된다.
    1;
    '1';  //서로 다르다
    // 문자열 상수표현식을 사용하면 무조건 마지막에 컴파일러가 0을 붙여주게 된다.
    // 0이 아니라면 문자로 인식한다.
    // 그래서 축약형으로 배열을 사용할때에는 마지막에 0을 생략하여 넣어주게 된다.
    //char Arr1[5] = "12345"; // 축약을 사용할때 마지막에는 무조건 0이 들어가는것으로 생각하여 
    // 배열의 크기를 정해주어야 함.
    char Arr2[5] = { '1', '2', '3', '4', '5' }; // 배열 5개에 각각 대응하는 값을 넣어줌

    //옳게되려면
    char Arr3[6] = "12345"; // 가 되어야합니다.
        //풀어쓰면
    Arr3[0] = 1;
    Arr3[1] = 2;
    Arr3[2] = 3;
    Arr3[3] = 4;
    Arr3[4] = 5;
    Arr3[5] = 0;  // 의 배열이 만들어지게 된다는 뜻이다.

    printf_s(Arr2);

    //char Value1 = Arr2; // 불가능한 코드  자료형이 서로 다르기때문에
    // 왼쪽은 char 1개의 2바이트 자료형인데 위에서 선언한 Arr1은 2바이트 char의 5개 집합 배열임.

    // 제로 베이스 기반.
    //배열의 개수를 셀때 0부터 세는것을
    //제로 베이스 기반 인덱스 표현이라고 합니다.


    // [] <= 랜덤인덱스 연산자



}

