
// 이 아래의 내용이 뭔가 의미가 있다고 치면
// 시작하고 f5를 눌렀을때 exe파일로 완성된다. <- 이걸 만들어내는 과정을 컴파일이라고 한다.
// 전처리기 > 컴파일러 > 어셈블러 > 링커 -> .exe 라는 과정을 거쳐서 만들어진다.

// 전처리기가 하는 일부터 알아보겠다.
// <= 이걸 주석이라고 하고 주석은 전처리문의 일종이다.
// 전처리기는 '전처리문' 이라고 하는 것들을 처리하는 단계이다.

// 전처리기가 하는일
// 1. 주석삭제 = 주석은 기본적으로 프로그램에 아무런 쓸모가 없으므로 지워서 컴파일을 하는데에 방해X하도록

// 전처리문은 여러가지가 있는데 대표적으로
// # <= 붙어있으면 왠만하면 전처리문으로 본다.


#include <iostream> // 컨트롤 + 시프트 + G  => 상위 코드열기 
// 이미 작성된 코드를 전처리문을 통해서 불러와서 사용할수 있게 해준다.

int main()
{
    std::cout << "Hello World!\n";
}

