// 003_MainFunction.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

// 객체지향 프로그래밍을 배우게 될텐데.
// 객체지향과 절차지향이 뭔지 알게될건데  추후에
// 초반에는 언어보다는 컴퓨터 공학적인 내용을 먼저 익히게 된다.

// 코드는 컴퓨터에게 무슨일을 시킬지 명령하는것.
// 절차지향이건, 객체지향이건, 함수형이건 무조건 순서가 있으며 동시에 수행시킬수는 없다. 위에서 아래로
// ...을 실행하라는 명령이 된다.
// 모든 프로그램에 있어 제일 첫 시작은 프로그램을 시작한다는 것이 된다.
// 그 시작점을 진입점이라고 한다.  진입점 == 프로그램의 시작점.


// 진입점에서부터 실행흐름이 생긴다.
// 이 실행흐름을 함수라고 부르기로 함.

int main()  // <= int main() 을 진입점으로 하기로 모두고 합의했다.(바꿀 수 있지만 그럴 이유가 없다.)
{ // 함수의 시작 {
    std::cout << "Hello World!\n";
} // 함수의 끝 }
// 개념적으로는 ~~ 할 것이다 라고 볼수있다.

